# [作業目標]

1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```


2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

# 作業

### 1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```

In [11]:
#import numpy as np
#import pandas as pd
#df.loc[ '2013-01-01', 'A'] 
#取出'2013-01-01'欄的 'A'
#df.loc[ '2013-01-01', ['A', 'B'] ] 
#取出'2013-01-01'欄的 'A' 'B'
#df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
#取出'2013-01-01'到'2013-01-02'的 'A' 
#df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
#取出'2013-01-01'到'2013-01-05'的 'A'到 'C'

### 2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

In [12]:
# 記得先 Import 正確的套件
import numpy as np
import pandas as pd

In [45]:
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
print(df)
print(df.iloc[[0,1,2],[0,1,2]])

       col1      col2      col3
0 -0.023614 -0.482019  0.210108
1 -0.734719 -0.227157  0.689870
2 -0.533405 -0.989535 -0.874460
3 -0.133253  0.411049  1.240260
4  1.853208  0.275665  1.411653
5 -1.930662 -0.087016  1.812566
       col1      col2      col3
0 -0.023614 -0.482019  0.210108
1 -0.734719 -0.227157  0.689870
2 -0.533405 -0.989535 -0.874460

In [42]:
print(df.iloc[[1,3,5],[0,1,2]])

       col1      col2      col3
1 -0.950900  1.187725 -0.441050
3  0.300484 -1.348993 -0.424830
5 -0.420999 -0.033018  0.668258

In [43]:
print(df.iloc[0:5,1:3])

       col2      col3
0 -0.437657 -0.086457
1  1.187725 -0.441050
2  0.530164  1.570928
3 -1.348993 -0.424830
4  1.199597 -0.214816

In [44]:
print(df.iloc[0:5,::2])

       col1      col3
0 -0.518431 -0.086457
1 -0.950900 -0.441050
2  0.530662  1.570928
3  0.300484 -0.424830
4  1.175514 -0.214816

### 3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

In [89]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
print(df)
df[df.iloc[0:,0] > 20]

     0   1   2   3
0   11  34  35  25
1   13  24  36  11
2   16  22  10  20
3   36  18  17  35
4   36  32  34  35
5   20  31  20  37
6   23  13  17  22
7   35  36  27  10
8   18  11  27  18
9   39  35  26  14
10  21  14  36  31
11  23  28  16  32
12  30  24  22  32
13  26  23  35  35
14  29  31  27  22

     0   1   2   3
3   36  18  17  35
4   36  32  34  35
6   23  13  17  22
7   35  36  27  10
9   39  35  26  14
10  21  14  36  31
11  23  28  16  32
12  30  24  22  32
13  26  23  35  35
14  29  31  27  22

In [90]:
df[df.iloc[0:,0] + df.iloc[0:,1] >50]

     0   1   2   3
3   36  18  17  35
4   36  32  34  35
5   20  31  20  37
7   35  36  27  10
9   39  35  26  14
11  23  28  16  32
12  30  24  22  32
14  29  31  27  22

In [72]:
df[(df[0]<30) & (df[1]>30)]

     0   1   2   3
7   11  35  35  10
8   21  35  18  12
10  14  36  15  31
13  16  37  22  35

In [112]:
df[df.sum(axis = 1)>100]

     0   1   2   3
0   11  34  35  25
3   36  18  17  35
4   36  32  34  35
5   20  31  20  37
7   35  36  27  10
9   39  35  26  14
10  21  14  36  31
12  30  24  22  32
13  26  23  35  35
14  29  31  27  22